//========================================================= 
/**@file PinDevAdapter.h 
 * @brief 基础密码键盘指令封装 
 * 
 * @date 2014-11-02   15:16:54 
 * @author Zhyioo 
 * @version 1.0
 */ 
#pragma once 
//--------------------------------------------------------- 
#include "../../../include/Base.h"
#include "../../../include/BaseDevice.h"
//---------------------------------------------------------
namespace zhou_yb {
namespace device {
namespace pinpad {
//--------------------------------------------------------- 

//--------------------------------------------------------- 
} // namespace pinpad
} // nameapace device
} // namespace zhou_yb
//========================================================= 