//========================================================= 
/**@file SrcGlobal.h 
 * @brief 包含库中的一些全局变量、函数 
 * 
 * @date 2011-10-17   19:23:49 
 * @author Zhyioo 
 * @version 1.0
 */ 
//--------------------------------------------------------- 
#ifndef _LIBZHOUYB_SRCGLOBAL_H_
#define _LIBZHOUYB_SRCGLOBAL_H_
//--------------------------------------------------------- 
// base
#include "../src/SrcBase.h"
//--------------------------------------------------------- 
// container
#include "../src/SrcContainer.h"
//--------------------------------------------------------- 
// base_device
#include "../src/SrcBaseDevice.h"
//--------------------------------------------------------- 
// device
#include "../src/SrcDevice.h"
//--------------------------------------------------------- 
// extension
#include "../src/SrcExtension.h"
//--------------------------------------------------------- 
#endif // _LIBZHOUYB_SRCGLOBAL_H_
//=========================================================