//========================================================= 
/**@file IDCardParser.cpp 
 * @brief device目录下IDCardDev库中全局变量、函数的实现
 * 
 * @date 2014-10-17   19:29:56 
 * @author Zhyioo 
 * @version 1.0
 */ 
#pragma once 
//--------------------------------------------------------- 
#include "../../device/idcard/IDCardParser.h"
//---------------------------------------------------------
namespace zhou_yb {
namespace device {
namespace idcard {
//---------------------------------------------------------
/// 二代证数据偏移量 
const ushort _id_info_table[16] = {
    // 姓名(30)     0
    0,
    // 性别(2)      1
    30,
    // 民族(4)      2
    32,
    // 出生年月(16) 3
    36,
    // 地址(70)     4
    52,
    // 身份证号(36) 5
    122,
    // 签发机关(30) 6
    158,
    // 起始日期(16) 7
    188,
    // 终止日期(16) 8
    204,
    // 保留项(36)   9
    220,
    /* 到此为文字信息,共占用256字节 10 */ 
    256,
    // 最新住址(70) 11
    0,
    //              12
    70,
    // 指纹数据1    13
    0,
    // 指纹数据2    14
    512,
    1024
};
//---------------------------------------------------------
} // namespace idcrad 
} // namespace device 
} // namespace zhou_yb 
//=========================================================